void Function() {
  //ฟังก์เดินของหุ่นยนต์
  MotorStop();         //หุ่นยนต์หยุด
  MotorStop(200);      //หุ่นยนต์หยุดตามเวลา
  Motor(50, 50);       //เดินหน้า
  Motor(-50, -50);     //ถอยหลัง
  Move(50, 50, 1000);  //Move(ความเร็วซ้าย,ความเร็วขวา,เวลา 1000 = 1วิ);

  FD(50, 1000);  //FD(ความเร็ว,เวลาที่ใช้ 1000 = 1 วิ); เดินหน้า
  BK(50, 1000);  //BK(ความเร็ว,เวลาที่ใช้ 1000 = 1 วิ); ถอยหลัง
  TL(50, 1000);  //TL(ความเร็ว,เวลาที่ใช้ 1000 = 1 วิ);  เลี้ยวซ้ายล้อเดียว
  TR(50, 1000);  //TR(ความเร็ว,เวลาที่ใช้ 1000 = 1 วิ); เลี้ยวขวาล้อเดียว
  SL(50, 1000);  //SL(ความเร็ว,เวลาที่ใช้ 1000 = 1 วิ); หมุนซ้ายสองล้อ
  SR(50, 1000);  //SR(ความเร็ว,เวลาที่ใช้ 1000 = 1 วิ); หมุนขวาสองล้อ

  SpinL();   //หมุนซ้ายจนกว่าเส้น
  SpinL2();  //หมุนซ้ายจนกว่าเส้น 2 ครั้ง
  SpinR();   //หมุนขวาจนกว่าเส้น
  SpinR2();   //หมุนขวาจนกว่าเส้น 2 ครั้ง

  //ฟังก์ชันที่ใช้เดินตามเส้น
  //คำสั่งหุ่นยนต์เมื่อเจอแยก  's' = หยุด  'p' = ข้ามแบบใช้เซนเซอร์  'f' = ข้ามแบบใช้เวลา   'r' = เลี้ยวขวาจนกว่าจะเจอเส้น  'l' = เลี้ยวซ้ายจนกว่าจะเจอเส้น

  //FF(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก);
  FF(60, 's');  //วิ่งจับแยกแบบสุ่ม 05 35 02
  FF(60, 'p');  //วิ่งจับแยกแบบสุ่ม 05 35 02
  FF(60, 'f');  //วิ่งจับแยกแบบสุ่ม 05 35 02
  FF(60, 'r');  //วิ่งจับแยกแบบสุ่ม 05 35 02
  FF(60, 'l');  //วิ่งจับแยกแบบสุ่ม 05 35 02

  //FFC(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก);
  FFC(60, 's');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 5 เจอเส้นพร้อมกัน
  FFC(60, 'p');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 5 เจอเส้นพร้อมกัน
  FFC(60, 'f');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 5 เจอเส้นพร้อมกัน
  FFC(60, 'r');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 5 เจอเส้นพร้อมกัน
  FFC(60, 'l');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 5 เจอเส้นพร้อมกัน

  //FFR(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก);
  FFR(60, 's');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 3 และ 5 เจอเส้นพร้อมกัน
  FFR(60, 'p');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 3 และ 5 เจอเส้นพร้อมกัน
  FFR(60, 'f');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 3 และ 5 เจอเส้นพร้อมกัน
  FFR(60, 'r');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 3 และ 5 เจอเส้นพร้อมกัน
  FFR(60, 'l');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 3 และ 5 เจอเส้นพร้อมกัน

  //FFL(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก);
  FFL(60, 's');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 2 เจอเส้นพร้อมกัน
  FFL(60, 'p');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 2 เจอเส้นพร้อมกัน
  FFL(60, 'f');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 2 เจอเส้นพร้อมกัน
  FFL(60, 'r');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 2 เจอเส้นพร้อมกัน
  FFL(60, 'l');  //วิ่งตามเส้นจนกว่า เซนเซอร์ที่ 0 และ 2 เจอเส้นพร้อมกัน

  //FF_DISTANCED(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก, ระยะของวัตถุ);
  FF_DISTANCED(60, 's', 10);  //วิ่งตามเส้นจนกว่าจะเจอวัตถุ
  FF_DISTANCED(60, 'p', 10);  //วิ่งตามเส้นจนกว่าจะเจอวัตถุ
  FF_DISTANCED(60, 'f', 10);  //วิ่งตามเส้นจนกว่าจะเจอวัตถุ
  FF_DISTANCED(60, 'r', 10);  //วิ่งตามเส้นจนกว่าจะเจอวัตถุ
  FF_DISTANCED(60, 'l', 10);  //วิ่งตามเส้นจนกว่าจะเจอวัตถุ


  //FF์NUM(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก, ช่องเซนเซอร์ที่ใช้จับแยก 0-5 ส่วนใหญ่ใช้ริมสุด 0 หรือ 5);
  FFNUM(60, 's', 0);  //วิ่งตามเส้นจนกว่าเซนเซอร์
  FFNUM(60, 'p', 0);  //วิ่งตามเส้นจนกว่าเซนเซอร์
  FFNUM(60, 'f', 5);  //วิ่งตามเส้นจนกว่าเซนเซอร์
  FFNUM(60, 'r', 5);  //วิ่งตามเส้นจนกว่าเซนเซอร์
  FFNUM(60, 'l', 5);  //วิ่งตามเส้นจนกว่าเซนเซอร์


  //FFWhite(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก);
  FFWhite(60, 's');  //วิ่งตามเส้นจนกว่าเซนเซอร์ทั้งหมดไม่เจอเส้น
  FFWhite(60, 'p');  //วิ่งตามเส้นจนกว่าเซนเซอร์ทั้งหมดไม่เจอเส้น
  FFWhite(60, 'f');  //วิ่งตามเส้นจนกว่าเซนเซอร์ทั้งหมดไม่เจอเส้น
  FFWhite(60, 'r');  //วิ่งตามเส้นจนกว่าเซนเซอร์ทั้งหมดไม่เจอเส้น
  FFWhite(60, 'l');  //วิ่งตามเส้นจนกว่าเซนเซอร์ทั้งหมดไม่เจอเส้น


  //FFBlack(ความเร็วมอเตอร์, คำสั่งที่ใช้เจอแยก);
  FFBlack(60, 's');  // วิ่งตรงธรรมดาจนกว่าจะเส้น
  FFBlack(60, 'p');  // วิ่งตรงธรรมดาจนกว่าจะเส้น
  FFBlack(60, 'f');  // วิ่งตรงธรรมดาจนกว่าจะเส้น
  FFBlack(60, 'r');  // วิ่งตรงธรรมดาจนกว่าจะเส้น
  FFBlack(60, 'l');  // วิ่งตรงธรรมดาจนกว่าจะเส้น

  //FFTimer(ความเร็วมอเตอร์, เวลาที่ใช้วิ่ง 1000 = 1);
  FFTimer(60, 1000);  //วิ่งตามเส้นจนกว่าหมดเวลา

  //servo(ยก ลง, คีบ อ้า);
  servo(50, 40);  //เซอร์โวเริ่มต้น+
}